Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
<?xml version="1.0" encoding="utf-8"?>

<device schemaVersion="1.1"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>WCH Ltd.</vendor>    <!-- device vendor name -->
    <vendorID>WCH</vendorID>    <!-- device vendor short name -->
    <name>CH585SFR</name>    <!-- name of part-->
    <series>CH58x</series>    <!-- device series the device belongs to -->
    <version>1.1</version>    <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
    <description>WCH wireless MCU CH58x Family Support, Drivers</description>
    <cpu>        <!-- details about the cpu embedded in the device -->
        <name>RISC-V</name>
        <revision>r0p0</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <nvicPrioBits>2</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>    <!-- byte addressable memory -->
    <width>32</width>    <!-- bus width is 32 bits -->
    <!-- default settings implicitly inherited by subsequent sections -->
    <size>32</size>    <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
    <resetValue>0x00000000</resetValue>    <!-- by default all bits of the registers are initialized to 0 on reset -->
    <resetMask>0xFFFFFFFF</resetMask>    <!-- by default all 32Bits of the registers are used -->

    <peripherals>
        <peripheral>
            <name>SYS</name>
            <description>System Control Register</description>
            <groupName>SystemControl</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR0</name>
                <description>TMR0_IRQHandler</description>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>GPIO_A</name>
                <description>GPIOA_IRQHandler</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>GPIO_B</name>
                <description>GPIOB_IRQHandler</description>
                <value>18</value>
            </interrupt>
            <interrupt>
                <name>SPI0</name>
                <description>SPI0_IRQHandler</description>
                <value>19</value>
            </interrupt>
            <interrupt>
                <name>BLEB</name>
                <description>BB_IRQHandler</description>
                <value>20</value>
            </interrupt>
            <interrupt>
                <name>BLEL</name>
                <description>LLE_IRQHandler</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>USB</name>
                <description>USB_IRQHandler</description>
                <value>22</value>
            </interrupt>
            <interrupt>
                <name>TMR1</name>
                <description>TMR1_IRQHandler</description>
                <value>24</value>
            </interrupt>
            <interrupt>
                <name>TMR2</name>
                <description>TMR2_IRQHandler</description>
                <value>25</value>
            </interrupt>
            <interrupt>
                <name>UART0</name>
                <description>UART0_IRQHandler</description>
                <value>26</value>
            </interrupt>
            <interrupt>
                <name>UART1</name>
                <description>UART1_IRQHandler</description>
                <value>27</value>
            </interrupt>
            <interrupt>
                <name>RTC</name>
                <description>RTC_IRQHandler</description>
                <value>28</value>
            </interrupt>
            <interrupt>
                <name>ADC</name>
                <description>ADC_IRQHandler</description>
                <value>29</value>
            </interrupt>
            <interrupt>
                <name>I2C</name>
                <description>I2C_IRQHandler</description>
                <value>30</value>
            </interrupt>
            <interrupt>
                <name>PWMX_SPI1</name>
                <description>PWMX_SPI1_IRQHandler</description>
                <value>31</value>
            </interrupt>
            <interrupt>
                <name>TMR3</name>
                <description>TMR3_IRQHandler</description>
                <value>32</value>
            </interrupt>
            <interrupt>
                <name>UART2</name>
                <description>UART2_IRQHandler</description>
                <value>33</value>
            </interrupt>
            <interrupt>
                <name>UART3</name>
                <description>UART3_IRQHandler</description>
                <value>34</value>
            </interrupt>
            <interrupt>
                <name>WDOG_BAT</name>
                <description>WDOG_BAT_IRQHandler</description>
                <value>35</value>
            </interrupt>
            <interrupt>
                <name>NFC</name>
                <description>NFC_IRQHandler</description>
                <value>36</value>
            </interrupt>
            <interrupt>
                <name>USB2DEVICE</name>
                <description>USB2_DEVICE_IRQHandler</description>
                <value>37</value>
            </interrupt>
            <interrupt>
                <name>USB2HOST</name>
                <description>USB2_HOST_IRQHandler</description>
                <value>38</value>
            </interrupt>
            <interrupt>
                <name>LED</name>
                <description>LED_IRQHandler</description>
                <value>39</value>
            </interrupt>
            <registers>
                <register>
                    <name>R32_IWDG_KR</name>
                    <description>WO, Watchdog key register, SAM</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>Write-Only</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>IWDG_KR</name>
                            <description>RO,KEY [15:0]: Key value</description>
                            <bitRange>[15:0]</bitRange>
                            <access>Write-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_IWDG_CFG</name>
                    <description>RW, Watchdog configuration register, SAM</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x4FFFXFFF</resetValue>
                    <fields>
                        <field>
                            <name>RLR</name>
                            <description>RW, RL [11:0]: Watchdog counter reload</description>
                            <bitRange>[11:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>PR</name>
                            <description>RO, Pre division factor (with write protection)</description>
                            <bitRange>[14:12]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>PVU</name>
                            <description>RO, Configure register update flag bit (with write protection)</description>
                            <bitRange>[15:15]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>COUNT</name>
                            <description>RO, Watchdog countdown counter</description>
                            <bitRange>[27:16]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>STOP_EN</name>
                            <description>RW, Watchdog stop enabled (with write protection)</description>
                            <bitRange>[29:29]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>WR_PROTECT</name>
                            <description>RW, Write protection</description>
                            <bitRange>[30:30]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>IWDG_EN</name>
                            <description>RW, Watch dog start switch: 1: ON; 0: Close</description>
                            <bitRange>[31:31]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>                
                <register>
                    <name>R16_CLK_SYS_CFG</name>
                    <description>RWA, system clock configuration, SAM</description>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0003</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_PLL_DIV</name>
                            <description>RWA, output clock divider from PLL or CK32M</description>
                            <bitRange>[4:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_SYS_MOD</name>
                            <description>RWA, system clock source mode: 00=divided from 32MHz</description>
                            <bitRange>[7:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_XROM_SCLK_SEL</name>
                            <description>RWA, XROM clock source</description>
                            <bitRange>[8:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_OSC32M_SEL</name>
                            <description>RWA, Selection of PLL clock source</description>
                            <bitRange>[9:9]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PLL_GATE_DISS</name>
                            <description>RWA, Do you turn off the PLL clock when switching the PLL clock source</description>
                            <bitRange>[12:12]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PLL_GATE_TIME</name>
                            <description>RWA, When switching the PLL clock source, turn off the time selection of the PLL clock</description>
                            <bitRange>[13:13]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_HFCK_PWR_CTRL</name>
                    <description>RWA, High frequency clock module power control register, SAM</description>
                    <addressOffset>0x0A</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x14</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_RC16M_PON</name>
                            <description>RWA,Enable items for the internal 16MHz oscillator HSI</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_XT32M_PON</name>
                            <description>RWA, External 32MHz oscillator HSE power control bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_XT32M_KEEP</name>
                            <description>RWA, Used to control the stopping of the clock system in pause mode</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_PLL_PON</name>
                            <description>RWA, PLL power control bit</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SLP_CLK_OFF0</name>
                    <description>RWA, sleep clock off control byte 0, SAM</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SLP_CLK_TMR0</name>
                            <description>RWA, Timer 0 clock source</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_TMR1</name>
                            <description>RWA, Timer 1 clock source</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_TMR2</name>
                            <description>RWA, Timer 2 clock source</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_TMR3</name>
                            <description>RWA, Timer 3 clock source</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_UART0</name>
                            <description>RWA, UART0 clock source</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_UART1</name>
                            <description>RWA, UART1 clock source</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_UART2</name>
                            <description>RWA, UART2 clock source</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_UART3</name>
                            <description>RWA, UART3 clock source</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SLP_CLK_OFF1</name>
                    <description>RWA, sleep clock off control byte 1, SAM</description>
                    <addressOffset>0x0D</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SLP_CLK_SPI0</name>
                            <description>RWA, close SPI0 clock</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_SPI1</name>
                            <description>RWA, close SPI1 clock</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_PWMX</name>
                            <description>RWA, close PWMx clock</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_I2C</name>
                            <description>RWA, close I2C clock</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_USB</name>
                            <description>RWA, close USB clock</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_USB2</name>
                            <description>RWA, close USB2 clock</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Write</access>
                        </field>                       
                        <field>
                            <name>RB_SLP_CLK_LCD</name>
                            <description>RWA, close LCD clock</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_BLE</name>
                            <description>RWA, close BLE clock</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SLP_WAKE_CTRL</name>
                    <description>RWA, wake control, SAM</description>
                    <addressOffset>0x0E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x20</resetValue>
                    <fields>
                        <field>
                            <name>RB_SLP_USB_WAKE</name>
                            <description>RWA, enable USB waking</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_USB2_WAKE</name>
                            <description>RWA, enable USB2 waking</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_GPIO_EDGE_WAKE</name>
                            <description>RWA, GPIO edge wake-up mode selection</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>                                                
                        <field>
                            <name>RB_SLP_RTC_WAKE</name>
                            <description>RWA, enable RTC waking</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_GPIO_WAKE</name>
                            <description>RWA, enable GPIO waking</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_BAT_WAKE</name>
                            <description>RWA, enable BAT waking</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_WAKE_EV_MODE</name>
                            <description>RWA, event wakeup mode</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_GPIO_WAKE_MODE</name>
                            <description>RWA, enable GPIO wake-up mode</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
