Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
                <register>
                    <name>R8_SLP_POWER_CTRL</name>
                    <description>RWA, peripherals power down control, SAM</description>
                    <addressOffset>0x0F</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_WAKE_DLY_MOD</name>
                            <description>RWA, wakeup delay time selection</description>
                            <bitRange>[1:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OFF_UTMI</name>
                            <description>RWA, Utmi_clk clock source</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>                        
                        <field>
                            <name>RB_SLP_CLK_RAMX</name>
                            <description>RWA, close main SRAM clock</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_RAM2K</name>
                            <description>RWA, close retention 2KB SRAM clock</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RAM_RET_LV</name>
                            <description>RWA, SRAM retention voltage selection</description>
                            <bitRange>[7:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SAFE_MODE_CTRL</name>
                    <description>RWA, Secure Access Mode Control Register, SAM</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x01</resetValue>
                    <fields>
                        <field>
                            <name>RB_SAFE_AUTO_EN</name>
                            <description>RWA, Enable automatic shutdown of security register.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_XROM_312M_SEL</name>
                            <description>RWA, XROM Clock Selection</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SAFE_CLK_CTRL</name>
                    <description>RWA, Secure access to clock control registers, SAM</description>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_OFF_NFC</name>
                            <description>RWA, NFC clock off enable.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OFF_ADC</name>
                            <description>RWA, ADC clock off enable</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OFF_LED</name>
                            <description>RWA, LED clock off enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SAFE_DEBUG_CTRL</name>
                    <description>RWA, Secure Access Debugging Control Register, SAM</description>
                    <addressOffset>0x12</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_DEBUG_DIS</name>
                            <description>RWA, DEBUG disable enable.</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SAFE_LRST_CTRL</name>
                    <description>RWA, Long term reset control register for secure access, SAM</description>
                    <addressOffset>0x13</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_LONG_RST_EN</name>
                            <description>RWA, Long reset enable.</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_LONG_TIM_SEL</name>
                            <description>RWA, Long reset time selection.</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_IWDG_RST_EN</name>
                            <description>RWA, Independent watchdog reset enable.</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>                         
                    </fields>
                </register>
                <register>
                    <name>R16_PIN_ALTERNATE</name>
                    <description>RW, function pin alternate configuration</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <access>Read-Write</access>
                    <fields>
                        <field>
                            <name>RB_PIN_TMR0</name>
                            <description>RW, TMR0 alternate pin enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_TMR1</name>
                            <description>RW, TMR1 alternate pin enable</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_TMR2</name>
                            <description>RW, TMR2 alternate pin enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_TMR3</name>
                            <description>RW, TMR3 alternate pin enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_UART0</name>
                            <description>RW, RXD0/TXD0 alternate pin enable</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_UART1</name>
                            <description>RW, RXD1/TXD1 alternate pin enable</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_UART2</name>
                            <description>RW, RXD2/TXD2 alternate pin enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_UART3</name>
                            <description>RW, RXD3/TXD3 alternate pin enable</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_SPI0</name>
                            <description>RW, SCS/SCK0/MOSI/MISO alternate pin enable</description>
                            <bitRange>[8:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_PWMX</name>
                            <description>RW, PWM4/PWM5/PWM7/PWM8/PWM9 alternate pin enable</description>
                            <bitRange>[10:10]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_I2C</name>
                            <description>RW, SCL/SDA alternate pin enable</description>
                            <bitRange>[11:11]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_MODEM</name>
                            <description>RW, DSR/DTR alternate pin enable</description>
                            <bitRange>[12:12]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_INTX</name>
                            <description>RW, INT24/INT25 function pin mapping selection bit</description>
                            <bitRange>[13:13]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_U0_INV</name>
                            <description>RW, UART0 input/output inversion enable</description>
                            <bitRange>[14:14]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RF_ANT_SW_EN</name>
                            <description>RW, RF antenna switch control output enable</description>
                            <bitRange>[15:15]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PIN_CONFIG</name>
                    <description>RW, Function pin configuration registere</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_PB16_8_SEL</name>
                            <description>RW, Selection of interrupt pins for PB8 and PB16</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_USB2_EN</name>
                            <description>RW, Enable high-speed USB pins</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_UDP_PU_EN</name>
                            <description>RW, Full speed USB UD+pin internal pull-up resistor enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_USB_EN</name>
                            <description>RW, Full speed USB pin enable</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PBHx_IN_DIS</name>
                            <description>RW, PB16~PB23 channel pin digital input disabled</description>
                            <bitRange>[15:8]</bitRange>
                            <access>Read-Write</access>
                        </field>                        
                    </fields>
                </register>
                <register>
                    <name>R32_PIN_IN_DIS</name>
                    <description>RW, Function pin digital input disable register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_PAx_IN_DIS</name>
                            <description>RW, PA0~PA15 channel pin digital input disabled</description>
                            <bitRange>[15:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PBLx_IN_DIS</name>
                            <description>RW, PB0~PB15 channel pin digital input disabled</description>
                            <bitRange>[31:16]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>                
                <register>
                    <name>R16_POWER_PLAN</name>
                    <description>RWA, power plan before sleep instruction, SAM</description>
                    <addressOffset>0x20</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x11DF</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWR_XROM</name>
                            <description>RWA, power for FlashROM</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_RAM32K</name>
                            <description>RWA, SRAM power supply for RAM2K</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_CORE</name>
                            <description>RWA, power retention for core and base peripherals</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_EXTEND</name>
                            <description>RWA, power retention for USB and BLE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_RAM96K</name>
                            <description>RWA, SRAM power supply for RAM24K</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_MAIN_ACT</name>
                            <description>RWA, Main power selection</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_SYS_EN</name>
                            <description>RWA, power for system</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_LDO_EN</name>
                            <description>RWA, Internal LDO control</description>
                            <bitRange>[8:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_DCDC_EN</name>
                            <description>RWA, DC/DC converter enable</description>
                            <bitRange>[9:9]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_DCDC_PRE</name>
                            <description>RWA, DC/DC converter pre-enable</description>
                            <bitRange>[10:10]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_MUST_0010</name>
                            <description>RWA, Must write 0010.</description>
                            <bitRange>[14:11]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_PLAN_EN</name>
                            <description>RWA, Enable sleep power planning and control</description>
                            <bitRange>[15:15]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_AUX_POWER_ADJ</name>
                    <description>RWA, aux power adjust control, SAM</description>
                    <addressOffset>0x22</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0XXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_ULPLDO_ADJ</name>
                            <description>RWA, Output voltage regulation value of auxiliary power supply for ultra-low power consumption LDO</description>
                            <bitRange>[2:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_DCDC_CHARGE</name>
                            <description>RWA, Low power auxiliary DC-DC enable bit</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CFG_IVREF</name>
                            <description>RWA, retain. The original value must be kept unchanged when writing</description>
                            <bitRange>[11:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_IB_TKEY_SEL</name>
                            <description>RWA, TouchKey bias current, used to stabilize I/O potential and prevent accidental wake-up</description>
                            <bitRange>[15:12]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_DET_CTRL</name>
                    <description>RWA, battery voltage detector control, SAM</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_DET_EN</name>
                            <description>RWA, When RB_BAT_MON_EN=0, it is enabled by high-precision battery voltage detection function</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_BAT_LOW_VTHX</name>
                            <description>RWA, When RB_BAT_MON_EN=1, set low power consumption</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_BAT_LOWER_IE</name>
                            <description>RWA, Battery ultra-low voltage interrupt enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>                        
                        <field>
                            <name>RB_BAT_LOWER_IE</name>
                            <description>RWA, interrupt enable for battery lower voltage</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_BAT_LOW_IE</name>
                            <description>RWA, interrupt enable for battery low voltage</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
