Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
                <register>
                    <name>R8_BAT_DET_CFG</name>
                    <description>RWA, battery voltage detector configuration, SAM</description>
                    <addressOffset>0x25</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x02</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_LOW_VTH</name>
                            <description>RWA, select threshold voltage of battery voltage low</description>
                            <bitRange>[1:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_STATUS</name>
                    <description>RO, battery status</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_STAT_LOWER</name>
                            <description>RO, battery lower voltage status, high action</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>RB_BAT_STAT_LOW</name>
                            <description>RO, battery low voltage status, high action</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_INT32K_TUNE</name>
                    <description>RWA, internal 32KHz oscillator tune control, SAM</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x1011</resetValue>
                    <fields>
                        <field>
                            <name>RB_INT32K_TUNE</name>
                            <description>RWA, Internal RC 32KHz clock frequency calibration value</description>
                            <bitRange>[12:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_XT32K_TUNE</name>
                    <description>RWA, External 32KHz oscillator tune control, SAM</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xC7</resetValue>
                    <fields>
                        <field>
                            <name>RB_XT32K_I_TUNE</name>
                            <description>RWA, Selection of bias current for external 32KHz oscillator</description>
                            <bitRange>[1:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RC32K_I_TUNE</name>
                            <description>RWA, RC32K adjustment bit, internal 32KHz oscillator bias current selection</description>
                            <bitRange>[3:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_XT32K_C_LOAD</name>
                            <description>RWA, Choose a built-in load capacitor that matches the external 32KHz crystal</description>
                            <bitRange>[7:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_CK32K_CONFIG</name>
                    <description>RWA, 32KHz oscillator configure</description>
                    <addressOffset>0x2F</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xX2</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_XT32K_PON</name>
                            <description>RWA, external 32KHz oscillator power on</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_INT32K_PON</name>
                            <description>RWA, internal 32KHz oscillator power on</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OSC32K_XT</name>
                            <description>RWA, 32KHz oscillator source selection: 0=RC, 1=XT</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OSC32K_FILT</name>
                            <description>RWA, internal 32KHz oscillator low noise mode enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_32K_CLK_PIN</name>
                            <description>RO, 32KHz oscillator clock pin status</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
