Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>UART1</name>
            <description>UART1 register</description>
            <groupName>UART</groupName>
            <baseAddress>0x40003400</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>UART1</name>
                <description>UART1_IRQHandler</description>
                <value>27</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_UART1_MCR</name>
                    <description>RW, UART1 modem control</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_MCR_OUT2/RB_MCR_INT_OE</name>
                            <description>RW, UART control OUT2/UART interrupt output enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_IER</name>
                    <description>RW, UART1 interrupt enable</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_IER_RECV_RDY</name>
                            <description>RW, UART interrupt enable for receiver data ready</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_IER_THR_EMPTY</name>
                            <description>RW, UART interrupt enable for THR empty</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_IER_LINE_STAT</name>
                            <description>RW, UART interrupt enable for receiver line status</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_IER_TXD_EN</name>
                            <description>RW, UART TXD pin enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_IER_RESET</name>
                            <description>WZ, UART software reset control, high action, auto clear</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_FCR</name>
                    <description>RW, UART1 FIFO control</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_FCR_FIFO_EN</name>
                            <description>RW, UART FIFO enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_FCR_RX_FIFO_CLR</name>
                            <description>WZ, clear UART receiver FIFO, high action, auto clear</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_FCR_TX_FIFO_CLR</name>
                            <description>WZ, clear UART transmitter FIFO, high action, auto clear</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_FCR_FIFO_TRIG</name>
                            <description>RW, UART receiver FIFO trigger level: 00-1byte, 01-2bytes, 10-4bytes, 11-7bytes</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_LCR</name>
                    <description>RW, UART1 line control</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_LCR_WORD_SZ</name>
                            <description>RW, UART word bit length: 00-5bit, 01-6bit, 10-7bit, 11-8bit</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_LCR_STOP_BIT</name>
                            <description>RW, UART stop bit length: 0-1bit, 1-2bit</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_LCR_PAR_EN</name>
                            <description>RW, UART parity enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_LCR_PAR_MOD</name>
                            <description>RW, UART parity mode: 00-odd, 01-even, 10-mark, 11-space</description>
                            <bitRange>[5:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_LCR_BREAK_EN</name>
                            <description>RW, UART break control enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_LCR_GP_BIT/RB_LCR_DLAB</name>
                            <description>RW, UART general purpose bit;RW, UART reserved bit</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_IIR</name>
                    <description>RO, UART1 interrupt identification</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x01</resetValue>
                    <fields>
                        <field>
                            <name>RB_IIR_NO_INT</name>
                            <description>RO, UART no interrupt flag: 0=interrupt action, 1=no interrupt</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_IIR_INT_MASK</name>
                            <description>RO, UART interrupt flag bit mask</description>
                            <bitRange>[3:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_IIR_FIFO_ID</name>
                            <description>RO, UART FIFO enabled flag</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_LSR</name>
                    <description>RO, UART1 line status</description>
                    <addressOffset>0x05</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x60</resetValue>
                    <fields>
                        <field>
                            <name>RB_LSR_DATA_RDY</name>
                            <description>RO, UART receiver fifo data ready status</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_LSR_OVER_ERR</name>
                            <description>RZ, UART receiver overrun error</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_LSR_PAR_ERR</name>
                            <description>RZ, UART receiver parity error</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_LSR_FRAME_ERR</name>
                            <description>RZ, UART receiver frame error</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_LSR_BREAK_ERR</name>
                            <description>RZ, UART receiver break error</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_LSR_TX_FIFO_EMP</name>
                            <description>RO, UART transmitter fifo empty status</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_LSR_TX_ALL_EMP</name>
                            <description>RO, UART transmitter all empty status</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_LSR_ERR_RX_FIFO</name>
                            <description>RO, indicate error in UART receiver fifo</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_RBR</name>
                    <description>RO, UART1 receiver buffer, receiving byte</description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UART1_RBR</name>
                            <description>RO, UART1 receiver buffer, receiving byte</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_THR</name>
                    <description>WO, UART1 transmitter holding, transmittal byte</description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UART1_RBR</name>
                            <description>WO, UART1 transmitter holding, transmittal byte</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_RFC</name>
                    <description>RO, UART1 receiver FIFO count</description>
                    <addressOffset>0x0A</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_UART1_RFC</name>
                            <description>RO, UART1 receiver FIFO count</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_TFC</name>
                    <description>RO, UART1 transmitter FIFO count</description>
                    <addressOffset>0x0B</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_UART1_TFC</name>
                            <description>RO, UART1 receiver FIFO count</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_UART1_DL</name>
                    <description>RW, UART1 divisor latch</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UART1_DL</name>
                            <description>RW, UART1 divisor latch</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UART1_DIV</name>
                    <description>RW, UART1 pre-divisor latch byte, only low 7 bit, from 1 to 128</description>
                    <addressOffset>0x0E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UART1_DIV</name>
                            <description>RW,  UART1 pre-divisor latch byte, only low 7 bit, from 1 to 128</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
