Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PWMx</name>
            <description>PWMx register</description>
            <groupName>PWMx</groupName>
            <baseAddress>0x40005000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PWMx</name>
                <description>PPWMX_SPI1_IRQHandler</description>
                <value>31</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_PWM_OUT_EN</name>
                    <description>RW, PWM output enable control</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM4_OUT_EN</name>
                            <description>RW, PWM4 output enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM5_OUT_EN</name>
                            <description>RW, PWM5 output enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM6_OUT_EN</name>
                            <description>RW, PWM6 output enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM7_OUT_EN</name>
                            <description>RW, PWM7 output enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM8_OUT_EN</name>
                            <description>RW, PWM8 output enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM9_OUT_EN</name>
                            <description>RW, PWM9 output enable</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM10_OUT_EN</name>
                            <description>RW, PWM10 output enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM11_OUT_EN</name>
                            <description>RW, PWM11 output enable</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_PWM_POLAR</name>
                    <description>RW, PWM output polarity control</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM4_POLAR</name>
                            <description>RW, PWM4 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM5_POLAR</name>
                            <description>RW, PWM5 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM6_POLAR</name>
                            <description>RW, PWM6 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM7_POLAR</name>
                            <description>RW, PWM7 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM8_POLAR</name>
                            <description>RW, PWM8 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM9_POLAR</name>
                            <description>RW, PWM9 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM10_POLAR</name>
                            <description>RW, PWM10 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM11_POLAR</name>
                            <description>RW, PWM11 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_PWM_CONFIG</name>
                    <description>RW, PWM configuration</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x0X</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM_CYCLE_SEL</name>
                            <description>RW, PWM cycle selection: 0=256;128;64;32 clocks, 1=255;127;63;31 clocks</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_STAG_ST</name>
                            <description>RO, PWM stagger cycle status</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>RB_PWM_CYC_MOD</name>
                            <description>RW, PWM data width mode: 00=8 bits data, 01=7 bits data, 10=6 bits data, 11=5 bits data</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM4_5_STAG_EN</name>
                            <description>RW, PWM4/5 stagger output enable: 0=independent output, 1=stagger output</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM6_7_STAG_EN</name>
                            <description>RW, PWM6/7 stagger output enable: 0=independent output, 1=stagger output</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM8_9_STAG_EN</name>
                            <description>RW, PWM8/9 stagger output enable: 0=independent output, 1=stagger output</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM10_11_STAG_EN</name>
                            <description>RW, PWM10/11 stagger output enable: 0=independent output, 1=stagger output</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_PWM_CLOCK_DIV</name>
                    <description>RW, PWM clock divisor</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_PWM_CLOCK_DIV</name>
                            <description>RW, PWM clock divisor</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PWM4_7_DATA</name>
                    <description>RW, PWM data retention register group 1</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_PWM4_DATA/R16_PWM4_DATA</name>
                            <description>RW, PWM4 data holding or PWM4 data holding(16bits wide)</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PWM5_DATA/R16_PWM4_DATA</name>
                            <description>RW, PWM5 data holding or PWM4 data holding(16bits wide)</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PWM6_DATA/R16_PWM5_DATA</name>
                            <description>RW, PWM6 data holding or PWM5 data holding(16bits wide)</description>
                            <bitRange>[23:16]</bitRange>
                        </field> 
                        <field>
                            <name>R8_PWM7_DATA/R16_PWM5_DATA</name>
                            <description>RW, PWM7 data holding or PWM5 data holding(16bits wide)</description>
                            <bitRange>[31:24]</bitRange>
                        </field>                                               
                    </fields>
                </register>
                <register>
                    <name>R32_PWM8_11_DATA</name>
                    <description>RW, PWM data retention register group 2</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_PWM8_DATA/R16_PWM6_DATA</name>
                            <description>RW, PWM8 data holding or PWM6 data holding(16bits wide)</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PWM9_DATA/R16_PWM6_DATA</name>
                            <description>RW, PWM9 data holding or PWM6 data holding(16bits wide)</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PWM10_DATA/R16_PWM7_DATA</name>
                            <description>RW, PWM10 data holding or PWM7 data holding(16bits wide)</description>
                            <bitRange>[23:16]</bitRange>
                        </field> 
                        <field>
                            <name>R8_PWM11_DATA/R16_PWM7_DATA</name>
                            <description>RW, PWM11 data holding or PWM7 data holding(16bits wide)</description>
                            <bitRange>[31:24]</bitRange>
                        </field>                                               
                    </fields>
                </register>                
                <register>
                    <name>R8_PWM_INT_CTRL</name>
                    <description>RW, PWM interrupt control</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM_IE_CYC</name>
                            <description>RW, enable interrupt for PWM cycle end</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_CYC_PRE</name>
                            <description>RW, select PWM cycle interrupt point</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_IF_CYC</name>
                            <description>RW1, interrupt flag for PWM cycle end</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PWM_REG_DATA8</name>
                    <description>RW, PWM8/9 data register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM8_REG_DATA</name>
                            <description>RW, 16 bit data of PWM8 channel</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM9_REG_DATA</name>
                            <description>RW, 16 bit data of PWM9 channel</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PWM_REG_CYCLE</name>
                    <description>RW, PWM cycle end register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM_CYC_VALUE</name>
                            <description>RW, PWM End Cycles</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
