Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>LCD</name>
            <description>LCD register</description>
            <groupName>LCD</groupName>
            <baseAddress>0x40006000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>R8_LCD_CMD</name>
                    <description>RW, LCD Command Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>SYS_EN</name>
                            <description>RW, System Enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>LCD_ON</name>
                            <description>RW, LCD switch</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>LCD_BIAS</name>
                            <description>RW, PWM6 Bias ratio selection enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>LCD_DUTY</name>
                            <description>RW, LCD duty cycle selection</description>
                            <bitRange>[4:3]</bitRange>
                        </field>
                        <field>
                            <name>SCAN_CLK_SEL</name>
                            <description>RW, Scan clock selection</description>
                            <bitRange>[6:5]</bitRange>
                        </field>
                        <field>
                            <name>VLCD_SEL</name>
                            <description>RW, LCD driver voltage selection</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_LCD_RAM0</name>
                    <description>RW, LCD RAM0 register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LCD_SEG0</name>
                            <description>RW, SEG0 segment data</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG1</name>
                            <description>RW, SEG1 segment data</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG2</name>
                            <description>RW, SEG2 segment data</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG3</name>
                            <description>RW, SEG3 segment data</description>
                            <bitRange>[15:12]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG4</name>
                            <description>RW, SEG4 segment data</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG5</name>
                            <description>RW, SEG5 segment data</description>
                            <bitRange>[23:20]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG6</name>
                            <description>RW, SEG6 segment data</description>
                            <bitRange>[27:24]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG7</name>
                            <description>RW, SEG7 segment data</description>
                            <bitRange>[31:28]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_LCD_RAM1</name>
                    <description>RW, LCD RAM1 register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LCD_SEG8</name>
                            <description>RW, SEG8 segment data</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG9</name>
                            <description>RW, SEG9 segment data</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG10</name>
                            <description>RW, SEG10 segment data</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG11</name>
                            <description>RW, SEG11 segment data</description>
                            <bitRange>[15:12]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG12</name>
                            <description>RW, SEG12 segment data</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG13</name>
                            <description>RW, SEG13 segment data</description>
                            <bitRange>[23:20]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG14</name>
                            <description>RW, SEG14 segment data</description>
                            <bitRange>[27:24]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG15</name>
                            <description>RW, SEG15 segment data</description>
                            <bitRange>[31:28]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_LCD_RAM2</name>
                    <description>RW, LCD RAM2 register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LCD_SEG16</name>
                            <description>RW, SEG16 segment data</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG17</name>
                            <description>RW, SEG17 segment data</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG18</name>
                            <description>RW, SEG18 segment data</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG19</name>
                            <description>RW, SEG19 segment data</description>
                            <bitRange>[15:12]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG20</name>
                            <description>RW, SEG20 segment data</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG21</name>
                            <description>RW, SEG21 segment data</description>
                            <bitRange>[23:20]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG22</name>
                            <description>RW, SEG22 segment data</description>
                            <bitRange>[27:24]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG23</name>
                            <description>RW, SEG23 segment data</description>
                            <bitRange>[31:28]</bitRange>
                        </field>                        
                    </fields>
                </register>
                <register>
                    <name>R32_LCD_RAM3</name>
                    <description>RW, LCD RAM3 register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LCD_SEG24</name>
                            <description>RW, SEG24 segment data</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG25</name>
                            <description>RW, SEG25 segment data</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG26</name>
                            <description>RW, SEG26 segment data</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>LCD_SEG27</name>
                            <description>RW, SEG27 segment data</description>
                            <bitRange>[15:12]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_LCD_SEG_EN</name>
                    <description>RW, LCD segment enable register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RB_LCD_SEG_EN</name>
                            <description>RW, Enable SEG0-SEG27 segment, high level effective</description>
                            <bitRange>[27:0]</bitRange>
                        </field>
                    </fields>
                </register>                
