Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
                <register>
                    <name>R8_UEP6_CTRL</name>
                    <description>endpoint 6 control</description>
                    <addressOffset>0x6A</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP7_T_LEN</name>
                    <description>endpoint 7 transmittal length</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP7_T_LEN</name>
                            <description>endpoint 7 transmittal length</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP7_CTRL</name>
                    <description>endpoint 7 control</description>
                    <addressOffset>0x6E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_EPn_MODE</name>
                    <description>endpoint n control,（n=8/10/11/12/13/14/15）</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RB_EP_T_EN</name>
                            <description>1: Enable endpoint 8-15 to send (IN); 0: Prohibit endpoints 8-15 from sending</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_EP_R_EN</name>
                            <description>1: Enable endpoints 8-15 to receive (OUT); 0: Prohibit endpoints 8-15 from receiving</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>RB_EP_T_AF</name>
                            <description>1: Enable endpoints 8-15 to send multiplexing; 0: Prohibit endpoints 8-15 from sending multiplexed messages</description>
                            <bitRange>[23:17]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UHOST_CTRL</name>
                    <description>USB host physical port control register</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xX0</resetValue>
                    <fields>
                        <field>
                            <name>RB_UH_PORT_EN</name>
                            <description>USB host port enable bit</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_BUS_RESET</name>
                            <description>USB host mode bus reset control bit</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_LOW_SPEED</name>
                            <description>USB host port low-speed mode enable bit</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_DM_PIN</name>
                            <description>Current UD- pin status</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_DP_PIN</name>
                            <description>Current UD+ pin status</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_PD_DIS</name>
                            <description>USB host port UD+/UD - pin internal pull-down resistor control bit</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UH_EP_MOD</name>
                    <description>USB host endpoint mode control register</description>
                    <addressOffset>0x0D</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UH_EP_RBUF_MOD</name>
                            <description>USB host receiving endpoint receiving data buffer mode control bit</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_EP_RX_EN</name>
                            <description>Host receiving endpoint receiving (IN) enable bit</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_EP_TBUF_MOD</name>
                            <description>Host sends endpoint sends data buffer mode control bit</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_EP_TX_EN</name>
                            <description>Host sends endpoint send (SETUP/OUT) enable bit</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                    </fields>
                </register> 
                <register>
                    <name>R16_UH_RX_DMA</name>
                    <description>USB host receiving buffer starting address</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UH_RX_DMA</name>
                            <description>USB host receiving endpoint receiving data buffer mode control bit</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>  
                <register>
                    <name>R16_UH_TX_DMA</name>
                    <description>USB host sends buffer starting address</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UH_TX_DMA</name>
                            <description>Starting address of host endpoint data sending buffer</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register> 
                <register>
                    <name>R8_UH_SETUP</name>
                    <description>USB Host Auxiliary Settings Register</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UH_SOF_EN</name>
                            <description>Automatically generate SOF packet enable bit</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_PRE_PID_EN</name>
                            <description>Low speed preamble packet PRE PID enable bit</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register> 
                <register>
                    <name>R8_UH_EP_PID</name>
                    <description>USB host token setting register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UH_ENDP</name>
                            <description>Set the endpoint number of the target device being operated on this time</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UH_TOKEN</name>
                            <description>Set the token PID packet identifier for this USB transfer transaction</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UH_RX_CTRL</name>
                    <description>USB host receiving endpoint control register</description>
                    <addressOffset>0x2A</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UH_R_RES</name>
                            <description>Response control bit of host receiver to IN transaction</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_R_AUTO_TOG</name>
                            <description>Synchronization trigger bit, automatic flipping enable control bit</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_R_TOG</name>
                            <description>Expected synchronization trigger bit for USB host receiver (handling IN transactions)</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UH_TX_LEN</name>
                    <description>USB host sends length register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UH_TX_LEN</name>
                            <description>Set the number of bytes of data to be sent by the USB host sending endpoint</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UH_TX_CTRL</name>
                    <description>USB host sends endpoint control register</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UH_T_RES</name>
                            <description>Response control bit of USB host transmitter to SETUP/OUT transaction</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_T_AUTO_TOG</name>
                            <description>Synchronization trigger bit, automatic flipping enable control bit</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UH_T_TOG</name>
                            <description>The synchronization trigger bit prepared by the USB host transmitter (handling SETUP/OUT transactions)</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                    </fields>
                </register>                                            
