Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>USBHS</name>
            <description>USB register</description>
            <groupName>USBHS</groupName>
            <baseAddress>0x40009000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>USBHS_DEVICE</name>
                <description>USB2_DEVICE_IRQHandler</description>
                <value>37</value>
            </interrupt>
            <interrupt>
                <name>USBHS_HOST</name>
                <description>USB2_HOST_IRQHandler</description>
                <value>38</value>
            </interrupt>
             <registers>
                <register>
                    <name>R8_USB2_CTRL</name>
                    <description>RW, USBHS control register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x07</resetValue>
                    <fields>
                        <field>
                            <name>LINK_RESET</name>
                            <description>LINK layer reset, highly effective</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>SIE_RESET</name>
                            <description>USB protocol processor reset, including endpoint related registers, highly effective</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>USB_ALL_CLR</name>
                            <description>Clear all interrupt flags</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PHY_SUSPENDM</name>
                            <description>USB PHY suspended</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>DEV_DMA_EN</name>
                            <description>DMA transfer enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>DEV_EN</name>
                            <description>USB device enablement</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>DEV_LPM_EN</name>
                            <description>LPM Enable</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_USB2_BASE_MODE</name>
                    <description>RW, USBHS control register</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>EXP_SPD[1:0]</name>
                            <description>Expected speed mode of the device</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                 <register>
                    <name>R8_USB2_INT_EN</name>
                    <description>RW, USBHS interrupt enable register</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>BUS_REST_IE</name>
                            <description>USB bus reset interrupt enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>BUS_SUSP_IE</name>
                            <description>USB bus pause interrupt enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>BUS_SLEEP_IE</name>
                            <description>USB bus sleep interrupt enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>LPM_ACT_IE</name>
                            <description>LPM transmission end interrupt enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RTX_ACT_IE</name>
                            <description>USB Transfer End Interrupt Enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RX_SOF_IE</name>
                            <description>Receive SOF packet interrupt enable</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>LINK_RDY_IE</name>
                            <description>USB connection interruption enabled</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>FIFO_OVER_IE</name>
                            <description>FIFO overflow interrupt</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_USB2_DEV_AD</name>
                    <description>RW, USBHS device address register</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_MASK_USB_ADDR[6:0]</name>
                            <description>USB device address</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_USB2_WAKE_CTRL</name>
                    <description>RW1Z, USBHS remote wake-up register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_RMT_WAKE</name>
                            <description>Remote wake-up, hardware auto reset</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_USB2_TEST_MODE</name>
                    <description>RW, USBHS test mode register</description>
                    <addressOffset>0x05</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TEST_J</name>
                            <description>Test mode, output J</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_TEST_K</name>
                            <description>Test mode, output K</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_TEST_PKT</name>
                            <description>Test mode, output a package</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_TEST_SE0NAK</name>
                            <description>Test mode, output SE0</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_TEST_EN</name>
                            <description>Enable Test Mode</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_USB2_LPM_DATA</name>
                    <description>RW, USBHS power management register</description>
                    <addressOffset>0x06</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x8000</resetValue>
                    <fields>
                        <field>
                            <name>LPM_DATA[10:0]</name>
                            <description>Power management data</description>
                            <bitRange>[10:0]</bitRange>
                        </field>
                        <field>
                            <name>LPM_BUSY</name>
                            <description>Power management busy</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_USB2_INT_FG</name>
                    <description>RW1Z, USBHS interrupt flag register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UIF_BUS_RST</name>
                            <description>USB bus reset interrupt flag bit, write 1 to reset to zero</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_UIF_SUSPEND_HS</name>
                            <description>USB bus hangs interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_UIF_BUS_SLEEP</name>
                            <description>USB bus sleep interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UIF_LPM_ACT</name>
                            <description>LPM transmission end interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_UIF_LPM_ACT</name>
                            <description>LPM transmission end interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_UIF_RTX_ACT</name>
                            <description>USB transfer end interrupt flag bit, cleared by RB-UMS_SHMOD bit</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UIF_RX_SOF</name>
                            <description>Receive SOF packet interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_UIF_LINK_RDY</name>
                            <description>USB connection interruption flag bit, write 1 to reset to zero</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UIF_FIFO_OV_HS</name>
                            <description>FIFO overflow interrupt flag bit, write 1 to reset to zero</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_USB2_INT_ST</name>
                    <description>RO, USBHS Interrupt Status Register</description>
                    <addressOffset>0x09</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UIS_EP_ID_MASK[2:0]</name>
                            <description>Endpoint number where data transmission occurs</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_UIS_EP_DIR</name>
                            <description>Endpoint data transmission direction</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_USB2_MIS_ST</name>
                    <description>RO, USBHS Miscellaneous Status Register</description>
                    <addressOffset>0x0A</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UMS_READY</name>
                            <description>USB connection status</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_UMS_SUSPEND_HS</name>
                            <description>USB suspended status</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_UMS_SLEEP</name>
                            <description>USB sleep state</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UMS_SIE_FREE_HS</name>
                            <description>USB idle state</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_UMS_SUSP_REQ</name>
                            <description>USB suspend request</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UMS_HS_MOD</name>
                            <description>Is the host high-speed</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_USB2_FRAM_NO</name>
                    <description>RO, USBHS frame register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>Read-Only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>USB_FRAME_NO[10:0]</name>
                            <description>Received frame number</description>
                            <bitRange>[10:0]</bitRange>
                        </field>
                        <field>
                            <name>MICRO_FRAME[2:0]</name>
                            <description>Received microframe number</description>
                            <bitRange>[15:13]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_USB2_BUS</name>
                    <description>RO, USBHS bus status memory</description>
                    <addressOffset>0x0E</addressOffset>
                    <size>16</size>
                    <access>Read-Only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>USB_WAKEUP</name>
                            <description>USB wake-up (highly effective)</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>USB_DP_ST</name>
                            <description>UDP status</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>USB_DM_ST</name>
                            <description>UDM status</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEP_TX_EN</name>
                    <description>RW, USBHS endpoint sends enable register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UEP_TX_EN[15:0]</name>
                            <description>0~15 endpoints send enable</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEP_RX_EN</name>
                    <description>RW, USBHS endpoint receive enable register</description>
                    <addressOffset>0x12</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UEP_RX_EN[15:0]</name>
                            <description>0~15 endpoints receive enable</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEP_T_TOG_AUTO</name>
                    <description>RW, USBHS endpoint receives automatic flip enable register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UEP_T_TOG_AUTO[7:0]</name>
                            <description>0~7 endpoint synchronization trigger bit automatic flip enable</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEP_R_TOG_AUTO</name>
                    <description>RW, USBHS endpoint receives automatic flip enable register</description>
                    <addressOffset>0x16</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UEP_R_TOG_AUTO[7:0]</name>
                            <description>0~7 endpoint synchronization trigger bit automatic flip enable</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UEP_T_BURST</name>
                    <description>RW, 0~7 endpoints burst send enable</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>UEP_T_BURST_EN[7:0]</name>
                            <description>0~7 endpoints burst send enable</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UEP_T_BURST_MODE</name>
                    <description>RW, USBHS Endpoint Send Mode Register</description>
                    <addressOffset>0x19</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>UEP_T_BURST_EN[7:0]</name>
                            <description>0~7 endpoints burst send enable</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UEP_R_BURST</name>
                    <description>RW, 0~7 endpoints burst receive enable</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>UEP_R_BURST_EN[7:0]</name>
                            <description>0~7 endpoints burst receive enable</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>    
                </register>
