Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
                <register>
                    <name>R8_UEP_R_RES_MODE</name>
                    <description>RW, USBHS Endpoint Receive Mode Register</description>
                    <addressOffset>0x1B</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>UEP_R_RES_MODE[7:0]</name>
                            <description>0~7 endpoints burst receive enable</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UEP_AF_MODE</name>
                    <description>RW, USBHS Endpoint Reuse Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UEP_T_AF[6:0]</name>
                            <description>1-7 endpoint reuse enabled</description>
                            <bitRange>[7:1]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UEP0_DMA</name>
                    <description>RW, Starting address register of endpoint 0 buffer</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>UEP_T_AF[6:0]</name>
                            <description>1-7 endpoint reuse enabled</description>
                            <bitRange>[7:1]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UEPn_RX_DMA(n=1~7)</name>
                    <description>RW, Endpoint n receives the starting address register of the buffer(n=1~7)</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>UEPn_RX_DMA[16:0]</name>
                            <description>The starting address of the receiving buffer for endpoint n. The address must be aligned with 4 bytes</description>
                            <bitRange>[16:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UEPn_TX_DMA(n=1~7)</name>
                    <description>RW, Endpoint n sends the starting address register of the buffer(n=1~7)</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R32_UEPn_TX_DMA[16:0]</name>
                            <description>The starting address of the sending buffer for endpoint n. The address must be aligned with 4 bytes</description>
                            <bitRange>[16:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UEPn_MAX_LEN(n=1~7)</name>
                    <description>RW, Endpoint n maximum length packet register(n=1~7)</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>UEPn_MAX_LEN[6:0]</name>
                            <description>UEPn_MAX_LEN[6:0]</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEP0_RX_LEN</name>
                    <description>RW, Endpoint 0 receives length register</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x00XX</resetValue>
                    <fields>
                        <field>
                            <name>UEPn_MAX_LEN[6:0]</name>
                            <description>UEPn_MAX_LEN[6:0]</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEPn_RX_LEN(n=1~7)</name>
                    <description>RW, Endpoint n single reception length register(n=1~7)</description>
                    <addressOffset>0x80</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>UEPn_RX_LEN[15:0]</name>
                            <description>Endpoint n receives data length in a single session(n=1~7)</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEP0_T_LEN</name>
                    <description>RW, Endpoint 0 sends length register</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x00XX</resetValue>
                    <fields>
                        <field>
                            <name>UEP0_T_LEN[6:0]</name>
                            <description>Endpoint 0 sends data length</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UEP0_TX_CTRL</name>
                    <description>RW, Endpoint 0 sends control register</description>
                    <addressOffset>0x9E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_RES_MASK[1:0]</name>
                            <description>Endpoint 0 controls the response sent</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>UEP_TOG_MASK[1:0]</name>
                            <description>Expected synchronization trigger bit for endpoint 0</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>UEP_T_NAK_ACT</name>
                            <description>Endpoint 0 sends NAK end flag, write 0 to clear</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>ENDP_T_DONE</name>
                            <description>Endpoint 0 sends end flag, write 0 to clear</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UEP0_RX_CTRL</name>
                    <description>RW, Endpoint 0 receives control register</description>
                    <addressOffset>0x9F</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_RES_MASK[1:0]</name>
                            <description>Endpoint 0 controls the received response</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>UEP_TOG_MASK1</name>
                            <description>Expected synchronization trigger bit for receiving endpoint 0</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SETUP_IS</name>
                            <description>Is the transaction received by endpoint 0 a SETUP transaction</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ENDP_R_TOG_MATCH</name>
                            <description>The received synchronization trigger bit matches the expected synchronization trigger bit</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>UEP_R_NAK_TOG</name>
                            <description>Endpoint 0 returns NAK for received data packet type</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>UEP_R_NAK_ACT</name>
                            <description>Endpoint 0 receives NAK end flag, write 0 to clear</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>ENDP_R_DONE</name>
                            <description>Endpoint 0 receives end flag, write 0 to clear</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEPn_T_LEN(n=1~7)</name>
                    <description>RW, Endpoint n sends data length(n=1~7)</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UEPn_T_LEN[15:0]</name>
                            <description>Endpoint n sends data length(n=1~7)</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UEPn_TX_CTRL(n=1~7)</name>
                    <description>RW, Endpoint n sends data length(n=1~7)</description>
                    <addressOffset>0xA2</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_RES_MASK[1:0]</name>
                            <description>Endpoint n controls the response sent(n=1~7)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>UEP_TOG_MASK[1:0]</name>
                            <description>Expected synchronization trigger bit for endpoint n's sending(n=1~7)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>UEP_T_NAK_ACT</name>
                            <description>Endpoint n sends NAK end flag, write 0 to clear(n=1~7)</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>ENDP_T_DONE</name>
                            <description>Endpoint n sends an end flag, write 0 to clear(n=1~7)</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UEPn_RX_CTRL(n=1~7)</name>
                    <description>RW, Endpoint n receives control registers(n=1~7)</description>
                    <addressOffset>0xA3</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_RES_MASK[1:0]</name>
                            <description>Endpoint n controls the received response(n=1~7)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>UEP_TOG_MASK[1:0]</name>
                            <description>Expected synchronization trigger bit for receiving endpoint n(n=1~7)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>ENDP_R_TOG_MATCH</name>
                            <description>The synchronization trigger bit received by endpoint n matches the expected synchronization trigger bit(n=1~7)</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>UEP_R_NAK_TOG</name>
                            <description>Endpoint n receives the return NAK and packet type(n=1~7)</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>UEP_R_NAK_ACT</name>
                            <description>Endpoint n receives NAK end flag, writes 0 to clear(n=1~7)</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>ENDP_R_DONE</name>
                            <description>Endpoint n receives the end flag, write 0 to clear(n=1~7)</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEP_T_ISO</name>
                    <description>RW, USBHS endpoint sends synchronization mode enable register</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UEP_T_ISO[6：0]</name>
                            <description>Upload endpoint (IN) synchronization mode enabled</description>
                            <bitRange>[7:1]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R16_UEP_R_ISO</name>
                    <description>RW, USBHS endpoint receiving synchronization mode enable register</description>
                    <addressOffset>0xBE</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UEP_R_ISO[6：0]</name>
                            <description>Enable the synchronization mode of the downstream endpoint (OUT)</description>
                            <bitRange>[7:1]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UH_CFG</name>
                    <description>RW, USBHS Host Configuration Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x07</resetValue>
                    <fields>
                        <field>
                            <name>ROOT_LINK_RESET</name>
                            <description>USB connection control module reset</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>ROOT_SIE_RESET</name>
                            <description>USB protocol processor reset, software reset required</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>ROOT_ALL_CLR</name>
                            <description>Clear interrupt flag and FIFO, software zeroing is required</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>ROOT_PHY_SUSPENDM</name>
                            <description>PHY hangs, turn off the UTMI clock of the controller</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ROOT_DMA_EN</name>
                            <description>Enable DMA transmission</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>ROOT_SOF_EN</name>
                            <description>Enable SOF packet transmission</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>ROOT_FORCE_FS</name>
                            <description>Force full speed FS</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>ROOT_LPM_EN</name>
                            <description>Enable LPM</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UH_INT_EN</name>
                    <description>RW, USBHS host interrupt enable register</description>
                    <addressOffset>0x102</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>WKUP_ACT_IE</name>
                            <description>Wake up interrupt enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESUME_ACT_IE</name>
                            <description>Bus recovery interrupt enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>USB_ACT_IE</name>
                            <description>USB end or transfer completion interrupt enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>SOF_ACT_IE</name>
                            <description>Enable SOF packet sending interrupt</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>TX_HALT_IE</name>
                            <description>Enable sending pause interrupt</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>FIFO_OV_IE</name>
                            <description>FIFO overflow interrupt enable</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UH_DEV_ADDR</name>
                    <description>RW, USBHS host device address register</description>
                    <addressOffset>0x103</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>DEV_ADDR[7:0]</name>
                            <description>Device Address</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>    
                </register>
