Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
                <register>
                    <name>R32_UH_CONTROL</name>
                    <description>RW, USBHS Host Control Register</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00XXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>PID_MASK[3:0]</name>
                            <description>Transaction token package PID</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>ENDP_MASK[3:0]</name>
                            <description>Transaction token package endpoint number</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>TOG_MASK[1:0]</name>
                            <description>Sent data PID</description>
                            <bitRange>[9:8]</bitRange>
                        </field>
                        <field>
                            <name>BUF_MODE</name>
                            <description>Data cache control bit</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>HOST_ACTION</name>
                            <description>HOST enables transaction execution, and this bit is automatically reset to zero after the transaction is completed</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>LPM_VALID</name>
                            <description>Sending LPM package is valid</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>SPLIT_VALID</name>
                            <description>Sending SPLIT package is valid</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>DOWN_LOWSPD</name>
                            <description>When the port is operating at full speed and needs to send low-speed packets (PRE), this bit must be enabled</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>TX_NO_DATA</name>
                            <description>There is no data packet after the OUT/SETUP token packet, used for high-speed SPLIT packets</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>RX_NO_DATA</name>
                            <description>Expected data packet after IN token packet, used for high-speed SPLIT packet</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>TX_NO_RES</name>
                            <description>OUT/SETUP - DATA does not expect a response, used for synchronous transmission or high-speed SPLIT packets</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>RX_NO_RES</name>
                            <description>IN-DATA no response, used for synchronous transmission or high-speed SPLIT packets</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UH_INT_FLAG</name>
                    <description>RW1Z, USBHS host interrupt flag register</description>
                    <addressOffset>0x108</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_WKUP_IF</name>
                            <description>Wake up interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_RESUME_ACT_IF</name>
                            <description>Bus recovery interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_USB_ACT_IF</name>
                            <description>USB transaction transfer completion interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SOF_ACT_IF</name>
                            <description>SOF packet sending completion interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_TX_HALT_IF</name>
                            <description>Send abort interrupt flag</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_FIFO_OV_IF</name>
                            <description>FIFO overflow interrupt flag</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UH_INT_ST</name>
                    <description>RW, USBHS host interrupt status register</description>
                    <addressOffset>0x109</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>THIS_PID_MASK[3:0]</name>
                            <description>Received PID.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>PORT_RX_RESUME</name>
                            <description>This bit is 1, indicating that the port has received a wake-up signal</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_UH_MIS_ST</name>
                    <description>RW, USBHS host miscellaneous status register</description>
                    <addressOffset>0x10A</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_SOF_FREE</name>
                            <description>Port enabled status</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SOF_PRE</name>
                            <description>The USB bus SOF packet indicates a status of</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SOF_ST</name>
                            <description>USB bus SOF status</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_USB_WAKEUP</name>
                            <description>USB bus wake-up</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_LINESTATE_MASK</name>
                            <description>USB bus status</description>
                            <bitRange>[5:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_BUS_J</name>
                            <description>J on the USB bus</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_BUS_SE0</name>
                            <description>SEO on USB bus</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UH_LPM</name>
                    <description>RW, USBHS Host Power Management Data Register</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000XXX</resetValue>
                    <fields>
                        <field>
                            <name>LPM_DATA</name>
                            <description>Power management data</description>
                            <bitRange>[10:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UH_SPLIT</name>
                    <description>RW, USBHS Host SPLIT Register</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>SPLIT_DATA</name>
                            <description>SPLIT_DATA</description>
                            <bitRange>[18:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UH_FRAME</name>
                    <description>RW, USBHS Host Frame Register</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000000</resetValue>
                    <fields>
                        <field>
                            <name>FRAME_NO</name>
                            <description>frame number</description>
                            <bitRange>[10:0]</bitRange>
                        </field>
                        <field>
                            <name>MICRO_FRAME_HS</name>
                            <description>Micro frame number</description>
                            <bitRange>[18:16]</bitRange>
                        </field>
                        <field>
                            <name>SOF_CNT_EN</name>
                            <description>SOF Count Enable</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>SOF_CNT_CLR</name>
                            <description>SOF count reset to zero</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UH_TX_LEN</name>
                    <description>RW, USBHS host sends length register</description>
                    <addressOffset>0x118</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000XXX</resetValue>
                    <fields>
                        <field>
                            <name>TX_LEN</name>
                            <description>Sending data length</description>
                            <bitRange>[10:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UH_RX_LEN</name>
                    <description>RW, USBHS host receives length register</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000XXX</resetValue>
                    <fields>
                        <field>
                            <name>RX_LEN</name>
                            <description>Received data length</description>
                            <bitRange>[10:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UH_RX_MAX_LEN</name>
                    <description>RW, USBHS host receives maximum length register</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000XXX</resetValue>
                    <fields>
                        <field>
                            <name>UH_RX_MAX_LEN</name>
                            <description>Received data max length</description>
                            <bitRange>[10:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UH_RX_DMA</name>
                    <description>RW, DMA receiving address register</description>
                    <addressOffset>0x124</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R32_UH_RX_DMA</name>
                            <description>Receiving Address</description>
                            <bitRange>[16:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_UH_TX_DMA</name>
                    <description>RW, DMA sending address register</description>
                    <addressOffset>0x128</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UH_TX_DMA_HS</name>
                            <description>Sending Address</description>
                            <bitRange>[16:0]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_PORT_CTRL</name>
                    <description>WO, USBHS host port control register</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>32</size>
                    <access>Read-Only</access>
                    <resetValue>0x0000X000</resetValue>
                    <fields>
                        <field>
                            <name>SET_PORT_RESET</name>
                            <description>Port sending reset</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>SET_PORT_SUSP</name>
                            <description>PORT enters suspended state</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>CLR_PORT_SUSP</name>
                            <description>PORT exits suspended state</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>SET_PORT_SLEEP</name>
                            <description>PORT enters SLEEP state (LPM)</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>CLR_PORT_EN</name>
                            <description>PORT exits the enabled state and enters the disabled state</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>CLR_PORT_CONNECT</name>
                            <description>Put the port into port state</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>CLR_PORT_SLEEP</name>
                            <description>PORT exits SLEEP state (LPM)</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>PORT_SLEEP_BESL</name>
                            <description>Wake up time control</description>
                            <bitRange>[15:12]</bitRange>
                        </field>
                        <field>
                            <name>BUS_RST_LONG</name>
                            <description>Bus reset time selection</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_PORT_CFG</name>
                    <description>RO, USBHS host port configuration register</description>
                    <addressOffset>0x130</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>HOST_MODE</name>
                            <description>USB port mode selection</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PORT_RPD</name>
                            <description>Enable 15K resistor pull-down in host mode</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_PORT_INT_EN</name>
                    <description>RO, USBHS host port configuration register</description>
                    <addressOffset>0x132</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>PORT_CONNECT_IE</name>
                            <description>Port connection status change interrupt enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PORT_EN_IE</name>
                            <description>Port enable status change interrupt enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>PORT_SUSP_IE</name>
                            <description>Port pause status change interrupt enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PORT_RESET_IE</name>
                            <description>Port reset status change interrupt enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>PORT_SLP_IE</name>
                            <description>Port sleep state change interrupt enable</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_PORT_TEST_CT</name>
                    <description>RW, USBHS host port test mode register</description>
                    <addressOffset>0x133</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>TEST_J</name>
                            <description>Test output J</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TEST_K</name>
                            <description>Test output K</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>TEST_FORCE_EN</name>
                            <description>Enable Test Mode</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                    </fields>    
                </register>
