Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
                <register>
                    <name>R16_PORT_STATUS</name>
                    <description>RO, USBHS Host Port Status Register</description>
                    <addressOffset>0x134</addressOffset>
                    <size>16</size>
                    <access>Read-Only</access>
                    <resetValue>0x0010</resetValue>
                    <fields>
                        <field>
                            <name>PORT_C0NNECT</name>
                            <description>Port connection status</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PORT_EN</name>
                            <description>Port Enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>PORT_SUSP</name>
                            <description>Port paused state</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PORT_RESTTING</name>
                            <description>Port reset status</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>PORT_SLP</name>
                            <description>Port sleep</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>PORT_LOW_SPD</name>
                            <description>Is the port connection speed low</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>PORT_HIGH_SPD</name>
                            <description>Is the port connection speed high</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>PORT_TEST</name>
                            <description>Is the port in test mode</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_PORT_STATUS_CHG</name>
                    <description>RW1Z, USBHS Host Port Status Register</description>
                    <addressOffset>0x136</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>PORT_CONNECT_IF</name>
                            <description>Port connection status changes, write 1 to reset to zero</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PORT_EN_IF</name>
                            <description>Port enable status changes, write 1 to reset to zero</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>PORT_SUSP_IF</name>
                            <description>Port pause status changes, write 1 to reset to zero</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PORT_RESET_IF</name>
                            <description>Port reset status changes, write 1 to reset to zero</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>PORT_SLP_IF</name>
                            <description>Port sleep status changes, write 1 to reset to zero</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R32_ROOT_BC_CTRL</name>
                    <description>RW, USBHS host BC charging control register</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UDP_BC_CMPO</name>
                            <description>UDP pin BC protocol comparator status</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>UDM_BC_CMPO</name>
                            <description>UDM pin BC protocol comparator status</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>UDP_BC_CMPE</name>
                            <description>UDP pin BC protocol comparator enabled</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>UDM_BC_CMPE</name>
                            <description>UDM pin BC protocol comparator enabled</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>BC_AUTO_MODE</name>
                            <description>Automatic mode enabled</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>UDP_BC_VSRC</name>
                            <description>UDP pin BC protocol source voltage enable</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>UDM_BC_VSRC</name>
                            <description>UDM pin BC protocol source voltage enabled</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>UDM_VSRC_ACT</name>
                            <description>In automatic mode, this bit represents the UDM output VBC_SRC, otherwise it is controlled by UDM-BC_CMPE</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                    </fields>    
                </register>
                <register>
                    <name>R8_USBHS_PLL_CTRL</name>
                    <description>RW, USBHS PLL Clock Control Register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>USBHS_PLL_CKSEL</name>
                            <description>Selection of internal reference clock source for USBHS</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>USBHS_PLL_LOWPOW</name>
                            <description>USBHS PLL low-power mode (can only be enabled when USB20 application is at fixed low full speed, cannot be enabled when not at fixed low full speed)</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>USBHS_PLL_EN</name>
                            <description>USBHS PLL Enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                    </fields>    
                </register>
