Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
            </registers>    
        </peripheral>
        <peripheral>
            <name>BLE</name>
            <description>BLE register</description>
            <groupName>BLE</groupName>
            <baseAddress>0x4000C000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x1400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>BLEL</name>
                <description>LLE_IRQHandler</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>BLEB</name>
                <description>BB_IRQHandler</description>
                <value>20</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>LED</name>
            <description>LED register</description>
            <groupName>LED</groupName>
            <baseAddress>0x4000F000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LED</name>
                <description>LED_IRQHandler</description>
                <value>39</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_LED_CTRL_MOD</name>
                    <description>RW, LED mode configuration register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_LED_BIT_ORDER</name>
                            <description>Selection of LED serial data bit sequence</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_ALL_CLEAR</name>
                            <description>LED FIFO/counter/interrupt flag reset to zero</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_OUT_POLAR</name>
                            <description>LED data output polarity control bit</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_OUT_EN</name>
                            <description>LED signal output enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_DMA_EN</name>
                            <description>LED DMA function and DMA interrupt enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_IE_FIFO</name>
                            <description>FIFO count over half interrupt enabled</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_CHAN_MOD</name>
                            <description>LED channel mode selection</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_LED_CLOCK_DIV</name>
                    <description>RW, LED serial clock divider register</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x10</resetValue>
                    <fields>
                        <field>
                            <name>R8_LED_CLOCK_DIV</name>
                            <description>LED output clock frequency division coefficient</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_LED_CTRL_MOD1</name>
                    <description>RW, LED mode configuration register 1</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x10</resetValue>
                    <fields>
                        <field>
                            <name>R8_LED_DMA_LOOP</name>
                            <description>Enable LED DMA data cycling usage</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_IE_SEND_END</name>
                            <description>DMA All Data Transfer End Interrupt Enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_LED_STATUS</name>
                    <description>RW1, LED status register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x00A0</resetValue>
                    <fields>
                        <field>
                            <name>RB_LED_FIFO_COUNT</name>
                            <description>The byte count value in the current FIFO must be even</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_CLOCK</name>
                            <description>Current LED clock signal level status</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_IF_FIFO</name>
                            <description>FIFO count over half interrupt flag, write 1 to reset or write R16_SED_LFO to reset</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_LOAD_FAIL</name>
                            <description>Loading data results</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_IF_DMA_END</name>
                            <description>DMA completion flag, write 1 to reset or write R16_SED-DMA_CNT to reset</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>RB_LED_IF_DMA_INT</name>
                            <description>DMA transfer end interrupt flag bit</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_LED_FIFO</name>
                    <description>WO, LED data FIFO register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>Write-Only</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R32_LED_FIFO</name>
                            <description>LED data FIFO input, 32-bit write</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_LED_DMA_LEN</name>
                    <description>WO, LED DMA transmission length</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>Write-Only</access>
                    <resetValue>0x0XXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_LED_DMA_LENGTH</name>
                            <description>DMA transmission count length</description>
                            <bitRange>[11:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_LED_DMA_CNT</name>
                    <description>WO, LED DMA remaining count register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>Write-Only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_LED_DMA_CNT</name>
                            <description>LED_SMA_maIN Main Buffer Current DMA Remaining Words (16 bits) Count</description>
                            <bitRange>[11:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_LED_DMA_BEG</name>
                    <description>RW, LED DMA starting address</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_LED_DMA_BEG</name>
                            <description>DMA starting address</description>
                            <bitRange>[16:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_LED_DMA_CUR</name>
                    <description>RO, LED DMA current address</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>Read-Only</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_LED_DMA_CUR</name>
                            <description> LED DMA current address</description>
                            <bitRange>[16:2]</bitRange>
                        </field>
                    </fields>
                </register>
