Community-PIO-CH32V/platform-ch32v/misc/svd/CH585.svd
                <register>
                    <name>R32_PFIC_IPRIOR36</name>
                    <displayName>IPRIOR36</displayName>
                    <description>Interrupt Priority configuration Register 36</description>
                    <addressOffset>0x880</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR36</name>
                            <description>RW,Interrupt priority for number 144-147</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR37</name>
                    <displayName>IPRIOR37</displayName>
                    <description>Interrupt Priority configuration Register 37</description>
                    <addressOffset>0x8A0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR37</name>
                            <description>RW,Interrupt priority for number 148-151</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR38</name>
                    <displayName>IPRIOR38</displayName>
                    <description>Interrupt Priority configuration Register 38</description>
                    <addressOffset>0x8C0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR38</name>
                            <description>RW,Interrupt priority for number 152-155</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR39</name>
                    <displayName>IPRIOR39</displayName>
                    <description>Interrupt Priority configuration Register 39</description>
                    <addressOffset>0x8E0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR39</name>
                            <description>RW,Interrupt priority for number 156-159</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR40</name>
                    <displayName>IPRIOR40</displayName>
                    <description>Interrupt Priority configuration Register 40</description>
                    <addressOffset>0x900</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR40</name>
                            <description>RW,Interrupt priority for number 160-163</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR41</name>
                    <displayName>IPRIOR41</displayName>
                    <description>Interrupt Priority configuration Register 41</description>
                    <addressOffset>0x920</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR41</name>
                            <description>RW,Interrupt priority for number 164-167</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR42</name>
                    <displayName>IPRIOR42</displayName>
                    <description>Interrupt Priority configuration Register 42</description>
                    <addressOffset>0x940</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR42</name>
                            <description>RW,Interrupt priority for number 168-171</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR43</name>
                    <displayName>IPRIOR43</displayName>
                    <description>Interrupt Priority configuration Register 43</description>
                    <addressOffset>0x960</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR43</name>
                            <description>RW,Interrupt priority for number 172-175</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR44</name>
                    <displayName>IPRIOR44</displayName>
                    <description>Interrupt Priority configuration Register 44</description>
                    <addressOffset>0x980</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR44</name>
                            <description>RW,Interrupt priority for number 176-179</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR45</name>
                    <displayName>IPRIOR45</displayName>
                    <description>Interrupt Priority configuration Register 45</description>
                    <addressOffset>0x9A0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR45</name>
                            <description>RW,Interrupt priority for number 180-183</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR46</name>
                    <displayName>IPRIOR46</displayName>
                    <description>Interrupt Priority configuration Register 46</description>
                    <addressOffset>0x9C0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR46</name>
                            <description>RW,Interrupt priority for number 184-187</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR47</name>
                    <displayName>IPRIOR47</displayName>
                    <description>Interrupt Priority configuration Register 47</description>
                    <addressOffset>0x9E0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR47</name>
                            <description>RW,Interrupt priority for number 188-191</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR48</name>
                    <displayName>IPRIOR48</displayName>
                    <description>Interrupt Priority configuration Register 48</description>
                    <addressOffset>0xA00</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR48</name>
                            <description>RW,Interrupt priority for number 192-195</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR49</name>
                    <displayName>IPRIOR49</displayName>
                    <description>Interrupt Priority configuration Register 49</description>
                    <addressOffset>0xA20</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR49</name>
                            <description>RW,Interrupt priority for number 196-199</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR50</name>
                    <displayName>IPRIOR50</displayName>
                    <description>Interrupt Priority configuration Register 50</description>
                    <addressOffset>0xA40</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR50</name>
                            <description>RW,Interrupt priority for number 200-203</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR51</name>
                    <displayName>IPRIOR51</displayName>
                    <description>Interrupt Priority configuration Register 51</description>
                    <addressOffset>0xA60</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR51</name>
                            <description>RW,Interrupt priority for number 204-207</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR52</name>
                    <displayName>IPRIOR52</displayName>
                    <description>Interrupt Priority configuration Register 52</description>
                    <addressOffset>0xA80</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR52</name>
                            <description>RW,Interrupt priority for number 208-211</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR53</name>
                    <displayName>IPRIOR53</displayName>
                    <description>Interrupt Priority configuration Register 53</description>
                    <addressOffset>0xAA0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR53</name>
                            <description>RW,Interrupt priority for number 212-215</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR54</name>
                    <displayName>IPRIOR54</displayName>
                    <description>Interrupt Priority configuration Register 54</description>
                    <addressOffset>0xAD0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR54</name>
                            <description>RW,Interrupt priority for number 216-219</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR55</name>
                    <displayName>IPRIOR55</displayName>
                    <description>Interrupt Priority configuration Register 55</description>
                    <addressOffset>0xAE0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR55</name>
                            <description>RW,Interrupt priority for number 220-223</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR56</name>
                    <displayName>IPRIOR56</displayName>
                    <description>Interrupt Priority configuration Register 56</description>
                    <addressOffset>0xB00</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR56</name>
                            <description>RW,Interrupt priority for number 224-227</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR57</name>
                    <displayName>IPRIOR57</displayName>
                    <description>Interrupt Priority configuration Register 57</description>
                    <addressOffset>0xB20</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR57</name>
                            <description>RW,Interrupt priority for number 228-231</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR58</name>
                    <displayName>IPRIOR58</displayName>
                    <description>Interrupt Priority configuration Register 58</description>
                    <addressOffset>0xB40</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR58</name>
                            <description>RW,Interrupt priority for number 232-235</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR59</name>
                    <displayName>IPRIOR59</displayName>
                    <description>Interrupt Priority configuration Register 59</description>
                    <addressOffset>0xB60</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR59</name>
                            <description>RW,Interrupt priority for number 236-239</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR60</name>
                    <displayName>IPRIOR60</displayName>
                    <description>Interrupt Priority configuration Register 60</description>
                    <addressOffset>0xB80</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR60</name>
                            <description>RW,Interrupt priority for number 240-243</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR61</name>
                    <displayName>IPRIOR61</displayName>
                    <description>Interrupt Priority configuration Register 61</description>
                    <addressOffset>0xBA0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR61</name>
                            <description>RW,Interrupt priority for number 244-247</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR62</name>
                    <displayName>IPRIOR62</displayName>
                    <description>Interrupt Priority configuration Register 62</description>
                    <addressOffset>0xBE0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR62</name>
                            <description>RW,Interrupt priority for number 248-251</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR63</name>
                    <displayName>IPRIOR63</displayName>
                    <description>Interrupt Priority configuration Register 63</description>
                    <addressOffset>0xC00</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR63</name>
                            <description>RW,Interrupt priority for number 252-255</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_SCTLR</name>
                    <displayName>SCTLR</displayName>
                    <description>System Control Register</description>
                    <addressOffset>0xD10</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLEEPONEXIT</name>
                            <description>RW,SLEEPONEXIT</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>SLEEPDEEP</name>
                            <description>RW,SLEEPDEEP</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>WFITOWFE</name>
                            <description>RW,WFITOWFE</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>SEVONPEND</name>
                            <description>RW,SEVONPEND</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>SETEVENT</name>
                            <description>WO,SETEVENT</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                    </fields>
                </register>
